import { useState } from "react"


function App() {
  const [wonderN, setWonderN] = useState(0)

  const wonders = [
    {
      name: "Եգիպտական բուրգեր",
      description: "Աշխարհի 7 հրաշալիքների ցանկում ամենամեծ՝ Քեոփսի բուրգը, կառուցվել է մ. թ. ա. մոտ 2580 թ-ին։ Բուրգի բարձրությունը 147 մ է, հիմքի կողմի երկարությունը՝ 233 մ, կառուցված է 2.300 քարաբեկորներից, որոնցից յուրաքանչյուրը կշռում է միջին հաշվով 2, 5 տոննա։ Ըստ հույն ճանապարհորդ-պատմիչ Հերոդոտոսի՝ բուրգի կառուցումը տևել է 20 տարի, աշխատանքներին մասնակցել է 100 հազար ստրուկ։ Քեոփսի բուրգի ներսի պատերին հայտնաբերված մոնոսկրիպտների և պատկերների վերծանումից հայտնի դարձավ, որ ի սկզբանե բուրգը կառուցվել է Հայոց թագավոր Արա Գեղեցիկի պատվին։",
      img: "https://img-s1.onedio.com/id-564255737a6fb05c53c9f73f/rev-0/w-600/h-399/f-jpg/s-16982989f7ef28ed9d2c8a53637b116566f6cb1b.jpg"
    },

    {
      name: "Ալեքսանդրիայի փարոս",
      description: "Եգիպտոսի Ալեքսանդրիա քաղաքի մերձակա Փարոս կղզում մ. թ. ա. 320-ական թվականներին կառուցվել է հին ժամանակների ամենամեծ փարոսը՝ 135 մ բարձրությամբ եռահարկ աշտարակ, որը տեսանելի էր 60–100 կմ հեռավորությունից (ճարտարապետ՝ Սոստրատես)։ Հին աշխարհի միայն այս հրաշալիքը, ճարտարապետական նրբագեղությունից բացի, ուներ նաև կիրառական նշանակություն։ Փարոսը կործանվել է 1100 թ-ի երկրաշարժից (այլ տվյալներով՝ 1304 թ-ի կամ 1346 թ-ի երկրաշարժերից)։",
      img: "https://mamul.am/images/photos/150512/aleqsandriayi-pharos-n66998-1.jpg"
    },
    {
      name: "Զևսի արձան", description: "Հունաստանի Օլիմպոս քաղաքի՝ Զևսին նվիրված տաճարում էր 12 մ 40 սմ բարձրությամբ նրա արձանը, որը կերտել էր Ֆիդիասը մ. թ. ա. 440-ական թվականներին։ V դարի սկզբին տաճարն ավերվելուց հետո Զևսի արձանը տեղափոխվել է Կոստանդնուպոլիս, որտեղ 462 թ-ին ոչնչացել է հրդեհից։",
      img: "https://www.usanogh.am/wp-content/uploads/2020/03/zevsi-ardzan2-1.png"
    },

    {
      name: "Հռոդոսի կոթող", description: " Մ. թ. ա. III դարում Էգեյան ծովի Հռոդոս կղզու բնակիչները, ի նշանավորումն կղզու հաջող պաշտպանության, կանգնեցրել են Արևի աստված Հելիոսի՝ աշխարհի ամենամեծ՝ 36 մ-անոց արձանը՝ թշնամուց առգրավված զենքի մետաղից, որի կառուցումը տևել է 12 տարի։ Արձանի հեղինակ Քարեսն այն կերտել է 20 տարում։ Կոթողը կանգուն է եղել 56 տարի։ Երկրաշարժից (մ. թ. ա. 222 թ.) կործանված կոթողի բեկորները 977 թ-ին վաճառել է կղզու կառավարիչը՝ արաբ տեղապահը, որպես մետաղ(բրոնզ)։ Նավահանգստի հատակից հայտնաբերված արձանի աջ ձեռքի դաստակը պահվում է Բրիտանական թանգարանում:Հին աշխարհում Հռոդոսյան կոթողի վրայով անցնող միջորեականը համարվում էր առաջին կամ գլխավոր միջորեականը։ Դա ընդունել էր նաև Պտղոմեոսը,հետագայում էլ արաբները։ Բայց 16-րդ դարում այդ միջորեականը տեղափոխել են Կանայան կղզիներ, ապա Փարիզ, իսկ 1884 թվականից սկսած՝ Գրինվիչ։",
      img: "https://newsarmenia.am/upload/iblock/4fa/4fa6914fdd05bdd661d618f242d723f5.jpg"
    },

    {
      name: "Շամիրամի կախովի այգիներ", description: "Շամիրամի կախովի այգիները գտնվում էին Ասորեստանի Բաբելոն քաղաքում։ Ավանդությունն այդ այգիների ստեղծումը վերագրում է Շամիրամ թագուհուն, սակայն իրականում դրանք ստեղծվել են Նաբուգոդոնոսոր թագավորի հրամանով՝ մ. թ. ա. VI դարում։ Նա իր պալատը կառուցել էր 6-հարկանի տան բարձրությամբ արհեստական հարթակի վրա։ Դեպի այդ հարթակն աստիճանաձև բարձրանում էր աղյուսե 6 կամարասրահ։ Ամեն աստիճանի վրա հողի շերտ էր լցված, և ծաղկուն պարտեզ էր գցված։ Մ. թ. ա. 312 թ-ին կառույցը փլվել է ջրհեղեղներից։",
      img: "https://1.bp.blogspot.com/-aFkV1wPVloY/VUYleq9cr5I/AAAAAAAAAtc/eX5-LLJc-YI/s1600/babilon-gardens-reconstruction.jpg"
    },

    {
      name: "Հալիկառնասի դամբարան", description: "Հալիկառնասում (ներկայիս Թուրքիայի Բոդրում քաղաքի մերձակայքում) էր գտնվում աշխարհի հրաշալիքներից հաջորդը՝ Մավսոլես թագավորի հոյակերտ դամբարանը, որը կառուցել էր նրա այրին՝ Արտեմիսը, մ. թ. ա. 353 թ-ին։ Առաջին հարկը, որտեղ տեղադրված էր Մավսոլեսի աճյունասափորը, ուներ 8,9 մ լայնություն, 42,3 մ երկարություն, 11,1 մ բարձրություն, իսկ դամբարանի ընդհանուր բարձրությունը 60 մ էր։ Դամբարանը կանգուն է եղել 1800 տարի։ Մավսոլեսի և նրա կնոջ արձանները պահվում են Բրիտանական թանգարանում։",
      img: "https://www.usanogh.am/wp-content/uploads/2020/03/halikarnasi-dambaran2-1.png"
    },

    {
      name: "Արտեմիսի տաճար", description: "Մյուս հրաշալիքը հունական աստվածուհի Արտեմիսի մարմարե տաճարն էր Փոքր Ասիայի Եփեսոս քաղաքում։ Տաճարը կառուցվել է մ. թ. ա. 550 թ-ին, շինարարությունը տևել է 120 տարի։ Նախագծել է հույն ճարտարապետ Քերսիֆրոնեսը։ Շենքը զարդարող արձան-արձանիկների մի մասի հեղինակը Ֆիդիասն է։ Արտեմիսի տաճարը կանգուն է եղել 100 տարի։ Մ. թ. ա. 356 թ-ին եփեսացի Հերոստրատեսը, փառամոլության մոլուցքից կուրացած, հրդեհել է տաճարը։ 25 տարի անց այն վերակառուցվել է, սակայն ավերվել է երկրաշարժերից։ Տաճարի հարթաքանդակներից մի քանիսը պահվում են Բրիտանական թանգարանում։",
      img: "https://nelipiloyan.files.wordpress.com/2015/09/bcjoxfli92-258.jpg"
    }
  ]



  return (

    <div >
      <div style={{ display: "flex", }}>
        <div>
          {wonders.map(
            (x, i) =>
              <div
                key={i}
                onClick={() => setWonderN(i)}
                style={{ border: "1px solid black", padding: "33px" }}>
                {x.name}</div>)}
        </div>

        <div style={{ border: "1px solid black", padding: "10px" }}>
          {wonders[wonderN].description} </div>

        <div>
          <img src={wonders[wonderN].img} height={"200px"} width={"300px"} alt="" />
          {wonders.description}

        </div>



      </div>

    </div>
  )
}

export default App
